[
    {
        "title": "PCI DSS",
        "short": "PCI DSS (Payment Card Industry Data Security Standard) is a set of security protocols for organizations that handle credit card information, ensuring secure transactions and protection of sensitive data.",
        "long": "The Payment Card Industry Data Security Standard (PCI DSS) is a global standard for ensuring the security of credit card information and preventing fraud. It was established by major credit card brands, including Visa, Mastercard, and American Express, to protect cardholder data. The standard outlines 12 requirements, covering areas such as network security, access control, encryption, and monitoring. Compliance with PCI DSS is mandatory for organizations that store, process, or transmit credit card information, including merchants, processors, and financial institutions. By adhering to PCI DSS, organizations can reduce the risk of data breaches and protect sensitive information.",
        "tags": [
            "cybersecurity",
            "data"
        ]
    },
    {
        "title": "Domain Name System (DNS)",
        "short": "The Domain Name System (DNS) is a crucial internet infrastructure that translates human-readable domain names into machine-readable IP addresses, enabling devices to communicate with each other. It's a hierarchical decentralized system, allowing for efficient domain name resolution and routing.",
        "long": "The Domain Name System (DNS) is a fundamental component of the internet, facilitating communication between devices by resolving human-readable domain names into machine-readable IP addresses. This hierarchical decentralized system consists of a root domain, top-level domains, and lower-level domains, each managed by a domain name registrar. DNS uses a client-server architecture, where DNS resolvers (clients) query DNS servers for IP address resolutions. The system utilizes caching and recursive queries to optimize performance and reduce latency. DNS also supports various record types, such as A, NS, and MX, to provide additional functionality like mail server routing. Understanding DNS is essential for network administration, system design, and cybersecurity, as it plays a critical role in internet infrastructure.",
        "tags": [
            "networking",
            "system design",
            "cybersecurity",
            "web development"
        ]
    },
    {
        "title": "Network Address Translation",
        "short": "Network Address Translation (NAT) is a technique used to allow multiple devices on a private network to share a single public IP address when accessing the internet or other external networks.",
        "long": "Network Address Translation is a crucial concept in computer networking that enables multiple devices on a private network to share a single public IP address when accessing the internet or other external networks. This is achieved by modifying the source IP address of outgoing traffic and the destination IP address of incoming traffic. NAT routers maintain a translation table to keep track of these changes, ensuring that responses to outgoing requests are correctly routed back to the originating device. There are different types of NAT, including static NAT, dynamic NAT, and Port Address Translation (PAT). NAT is commonly used in home networks, where a single public IP address is provided by an Internet Service Provider (ISP), as well as in enterprise environments to conserve public IP addresses and improve network security.",
        "tags": [
            "networking",
            "system design",
            "cybersecurity"
        ]
    },
    {
        "title": "Ransomware",
        "short": "Ransomware is a type of malicious software that encrypts a victim's files or locks their device and demands a ransom in exchange for the decryption key or unlock code. This type of cyberattack has become increasingly common, with hackers targeting individuals, businesses, and organizations.",
        "long": "Ransomware is a subtype of malware that utilizes advanced encryption algorithms to restrict access to a victim's digital assets. It can spread through various means, including phishing emails, infected software downloads, and exploited vulnerabilities in networks and systems. Once infected, the ransomware encrypts files, making them inaccessible, and displays a ransom note demanding payment in exchange for the decryption key. Ransomware attacks can have devastating consequences, including data loss, financial losses, and disruption of critical operations. To mitigate these risks, it is essential to implement robust cybersecurity measures, such as regular backups, network segmentation, and employee education.",
        "tags": [
            "cybersecurity"
        ]
    }
]